XmlProcessingTester/SoapEnvelopMessage.xml

<soap:Envelope xmlns:wsrm="http://schemas.xmlsoap.org/ws/2005/02/rm" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
     <wsa:RelatesTo>r320715b-1b75-41af-a5bb-E03ea9885cEm</wsa:RelatesTo> 
    <wsa:ReplyTo>http://demo9647435.mockable.io/routerSendDummy</wsa:ReplyTo>
    <wsa:Action>teste</wsa:Action>
    <!--<wsrm:SequenceFault>sdfdsfsdfds</wsrm:SequenceFault>
    <wsrm:Sequence>sdfsd</wsrm:Sequence>
    <wsrm:SequenceAcknowledgement>erer</wsrm:SequenceAcknowledgement>
    <wsrm:AckRequested>wer</wsrm:AckRequested>-->
    <wsa:To>rerer</wsa:To>
    <wsa:MessageID>350f7679-c326-445d-880c-9eb7f419e624</wsa:MessageID>
    <wsa:From>IMT</wsa:From>
    <wsa:FaultTo>teste.io</wsa:FaultTo>
  </soap:Header>
  <soap:Body>
    <urn:InstaurarProcessoRequest xmlns:urn="urn:instauracaoAnulacaoProcesso">
      <urn:Declaracao>
        <urn:numeroFiscal>123456789</urn:numeroFiscal>
        <urn:codEntidade>2EA</urn:codEntidade>
        <urn:sf>0019</urn:sf>
        <urn:autoNoticia>
          <urn:id>111222333101</urn:id>
          <urn:dataEmissao>2019-03-13T00:00:00.000+01:00</urn:dataEmissao>
        </urn:autoNoticia>
                        <urn:infracoes>
          <urn:id>10</urn:id>
          <urn:codigo>A00141</urn:codigo>
          <urn:dataInfracao>2018-10-25T00:00:00.000+01:00</urn:dataInfracao>
          <urn:parametrosAdicionais>
            <urn:codigo>15</urn:codigo>
            <urn:valor>Testes com IMT</urn:valor>
          </urn:parametrosAdicionais>
          <urn:parametrosAdicionais>
            <urn:codigo>40</urn:codigo>
            <urn:valor>111222333100_DL</urn:valor>
          </urn:parametrosAdicionais>
          <urn:parametrosAdicionais>
            <urn:codigo>41</urn:codigo>
            <urn:valor>N</urn:valor>
          </urn:parametrosAdicionais>
        </urn:infracoes>
      </urn:Declaracao>
    </urn:InstaurarProcessoRequest>
  </soap:Body>
</soap:Envelope>
